import random

word_list = [
    'арбуз', 'ананас', 'банан', 'батон', 'булка', 'вишня', 'груша', 'дыня', 'изюм', 'каша', 
    'кефир', 'лимон', 'манго', 'орех', 'пирог', 'пицца', 'плов', 'репа', 'салат', 'сахар', 
    'слива', 'сыр', 'торт', 'тыква', 'укроп', 'фасоль', 'хлеб', 'цукат', 'чай', 'шоколад',
    'акула', 'белка', 'волк', 'ворона', 'выдра', 'гиена', 'голубь', 'жираф', 'зебра', 'змея', 
    'кабан', 'кобра', 'крыса', 'курица', 'лиса', 'медведь', 'мышь', 'норка', 'олень', 'паук', 
    'петух', 'пчела', 'рысь', 'слон', 'тигр', 'утка', 'хомяк', 'цапля', 'щука', 'ящерица',
    'ванна', 'веник', 'вилка', 'диван', 'доска', 'замок', 'коврик', 'ковш', 'котел', 'кран', 
    'кувшин', 'ложка', 'люстра', 'миска', 'мыло', 'ножницы', 'окно', 'плита', 'полка', 'рамка', 
    'свеча', 'сетка', 'стена', 'стул', 'таз', 'утюг', 'фара', 'штора', 'шкаф', 'экран',
    'актер', 'автор', 'балет', 'бокс', 'врач', 'гитара', 'гонка', 'декор', 'дизайн', 'забег', 
    'игра', 'йога', 'кино', 'клоун', 'кузнец', 'лепка', 'лыжник', 'маляр', 'музыка', 'пекарь', 
    'пилот', 'повар', 'песня', 'рыбак', 'спорт', 'судья', 'ткач', 'тренер', 'цирк', 'юрист',
    'адрес', 'аптека', 'базар', 'башня', 'билет', 'вагон', 'вокзал', 'город', 'дворец', 'дорога', 
    'завод', 'канал', 'касса', 'киоск', 'музей', 'набережная', 'парк', 'песок', 'площадь', 'пляж', 
    'почта', 'рынок', 'сквер', 'театр', 'трасса', 'улица', 'фонтан', 'центр', 'шахта', 'школа'
]

def get_word():
    select_word = random.choice(word_list).upper()
    return select_word

def is_valid(word):
    if word.isalpha():
        return True
    return False

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / \\
                   -
                ''',
                # голова, торс, обе руки, одна нога
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / 
                   -
                ''',
                # голова, торс, обе руки
                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |      
                   -
                ''',
                # голова, торс и одна рука
                '''
                   --------
                   |      |
                   |      O
                   |     \\|
                   |      |
                   |     
                   -
                ''',
                # голова и торс
                '''
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |     
                   -
                ''',
                # голова
                '''
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   -
                ''',
                # начальное состояние
                '''
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   -
                '''
    ]
    return stages[tries]

def get_letter():
    user = input('Попробуйте угадать букву или слово целиком:\n')

    while not is_valid(user):
        user = input('Вы ввели символ, не являющийся буквой!\nВведите букву или слово:\n')

    return user

def play(word):
    shifr_word = ['_'] * len(word)
    tries = 6
    used_chars = []
    guess_word = ''

    print('Давайте играть в угадайку слов!')
    print(display_hangman(tries))
    print(*shifr_word)
    
    while True:
        
        if tries == 0:
            print('К сожалению, вы не угадали слово :(')
            print(word)
            print(display_hangman(tries))
            break
        
        user = get_letter()

        if user.upper() == word:
            print('Поздравляем, вы угадали слово! Вы победили!')
            print(word)
            break

        if len(user) == 1:
            while user.upper() in used_chars:
                print('Вы уже вводили эту букву!\nВведите другую букву')
                user = get_letter()

            if user.upper() in word:
                
                for i in range(len(word)):
                    if word[i] == user.upper():
                        shifr_word[i] = word[i]
                
                used_chars.append(user.upper())

                print('Вы угадали букву!')
                print(*shifr_word)

                if shifr_word.count('_') == 0:
                    print('Вы угадали слово!')
                    print(word)
                    break
        
            else:
                tries -= 1
                used_chars.append(user.upper())

                print('К сожалению, такой буквы нет')
                print(*shifr_word)
                print(display_hangman(tries))
        
        else:
            tries -= 1
            print('Вы не угадали слово!')
            print(*shifr_word)
            print(display_hangman(tries))

while True:
    play(get_word())
    if input('Хотите сыграть еще?\n') != 'да':
        break